naughtyMin/MPC5744UnifiedBootloader/LedApp/Project_Settings/Startup_Code/startup_MPC5744P.S
;# Fill SRAM with writes of 32GPRs
sram_loop:
    e_stmw      r0, 0(r5)           ;# Write all 32 registers to SRAM
    e_addi      r5, r5, 128         ;# Increment the RAM pointer to next 128bytes
    e_bdnz      sram_loop           ;# Loop for all of SRAM

;#************************ Initialise Local Data SRAM ECC *********************
;# Store number of 128Byte (32GPRs) segments in Counter
 e_lis       r5, __LOCAL_DMEM_SIZE@h  ;#Initialize r5 to size of SRAM (Bytes)
 e_or2i      r5, __LOCAL_DMEM_SIZE@l
 e_srwi      r5, r5, 0x7            ;#Divide SRAM size by 128
 mtctr       r5                     ;#Move to counter for use with "bdnz"

;# Base Address of the Local SRAM
 e_lis       r5, __LOCAL_DMEM_BASE_ADDR@h
 e_or2i      r5, __LOCAL_DMEM_BASE_ADDR@l
;# Fill Local SRAM with writes of 32GPRs
ldmem_loop:
    e_stmw      r0,0(r5)             ;# Write all 32 registers to SRAM
    e_addi      r5,r5,128            ;#Increment the RAM pointer to next 128bytes
    e_bdnz      ldmem_loop           ;# Loop for all of SRAM

;#********************************* Enable BTB ********************************
;# Flush & Enable BTB - Set BBFI bit in BUCSR
    e_li      r3, 0x201
    mtspr     1013, r3
    se_isync

;#******************** Clear reservations on external interrupt *****************
;# Set ICR in HID0
    e_lis     r3, 0x2
    mtspr     1008, r3
    se_isync

;#*************************** Enable ME Bit in MSR *****************************
    mfmsr    r6
    e_or2i   r6, 0x1000
    mtmsr    r6

#if defined(I_CACHE) && (ICACHE_ENABLE == 1)
;#****************** Invalidate and Enable the Instruction cache **************
__icache_cfg:
    e_li     r5, 0x2
    mtspr    1011, r5

    e_li     r7, 0x4
    e_li     r8, 0x2
    e_lis    r11, 0xFFFF
    e_or2i   r11, 0xFFFB

__icache_inv:
    mfspr    r9, 1011
    and.     r10, r7, r9
    e_beq    __icache_no_abort
    and.     r10, r11, r9
    mtspr    1011, r10
    e_b      __icache_cfg

__icache_no_abort:
    and.     r10, r8, r9
    e_bne    __icache_inv

    mfspr    r5, 1011
    e_ori    r5, r5, 0x0001
    se_isync
    mtspr    1011, r5
#endif

#if defined(D_CACHE) && (DCACHE_ENABLE == 1)
;#****************** Invalidate and Enable the Data cache **************
__dcache_cfg:
    e_li r5, 0x2
    mtspr 1010, r5

    e_li r7, 0x4
    e_li r8, 0x2
    e_lis    r11, 0xFFFF
    e_or2i   r11, 0xFFFB

__dcache_inv:
    mfspr r9, 1010
    and.  r10, r7, r9
    e_beq   __dcache_no_abort
    and.  r10, r11, r9
    mtspr 1010, r10
    e_b __dcache_cfg

__dcache_no_abort:
    and.  r10, r8, r9
    e_bne __dcache_inv

    mfspr r5, 1010
    e_ori   r5, r5, 0x0001
    se_isync
    msync
    mtspr 1010, r5
#endif


;#****************************** Configure Stack *****************************
    e_lis       r1, __SP_INIT@h         ;# Initialize stack pointer r1 to
    e_or2i      r1, __SP_INIT@l         ;# value in linker command file.

    e_lis       r13, _SDA_BASE_@h       ;# Initialize r13 to sdata base
    e_or2i      r13, _SDA_BASE_@l       ;# (provided by linker).

    e_lis       r2, _SDA2_BASE_@h       ;# Initialize r2 to sdata2 base
    e_or2i      r2, _SDA2_BASE_@l       ;# (provided by linker).

    e_stwu      r0, -64(r1)             ;# Terminate stack.

#ifndef __NO_SYSTEM_INIT
;# Call the system init routine
    e_bl   SystemInit
#endif
;# Init .data and .bss sections
    e_bl   init_data_bss
    wrteei 1    ;# Enable interrupts
;# Call custom init function
;# This symbol must be defined in the ASM preprocessor e.g -DCUSTOM_INIT=my_func, 
;# where my_func is a void function that does not take any parameters and it is defined in the application code
#ifdef CUSTOM_INIT
    e_bl CUSTOM_INIT
#endif

;# Jump to Main
    e_bl        main

    .section .intc_vector_table, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   DefaultISR                       /* Vector #   0 Software setable flag 0 SSCIR0[CLR0] */
    .long   DefaultISR                       /* Vector #   1 Software setable flag 1 SSCIR0[CLR1] */
    .long   DefaultISR                       /* Vector #   2 Software setable flag 2 SSCIR0[CLR2] */
    .long   DefaultISR                       /* Vector #   3 Software setable flag 3 SSCIR0[CLR3] */
    .long   DefaultISR                       /* Vector #   4 Software setable flag 4 SSCIR0[CLR4] */
    .long   DefaultISR                       /* Vector #   5 Software setable flag 5 SSCIR0[CLR5] */
    .long   DefaultISR                       /* Vector #   6 Software setable flag 6 SSCIR0[CLR6] */
    .long   DefaultISR                       /* Vector #   7 Software setable flag 7 SSCIR0[CLR7] */
    .long   DefaultISR                       /* Vector #   8 Software setable flag 8 SSCIR0[CLR8] */
    .long   DefaultISR                       /* Vector #   9 Software setable flag 9 SSCIR0[CLR9] */
    .long   DefaultISR                       /* Vector #  10 Software setable flag 10 SSCIR0[CLR10] */
    .long   DefaultISR                       /* Vector #  11 Software setable flag 11 SSCIR0[CLR11] */
    .long   DefaultISR                       /* Vector #  12 Software setable flag 12 SSCIR0[CLR12] */
    .long   DefaultISR                       /* Vector #  13 Software setable flag 13 SSCIR0[CLR13] */
    .long   DefaultISR                       /* Vector #  14 Software setable flag 14 SSCIR0[CLR14] */
    .long   DefaultISR                       /* Vector #  15 Software setable flag 15 SSCIR0[CLR15] */
    .long   DefaultISR                       /* Vector #  16 */
    .long   DefaultISR                       /* Vector #  17 */
    .long   DefaultISR                       /* Vector #  18 */
    .long   DefaultISR                       /* Vector #  19 */
    .long   DefaultISR                       /* Vector #  20 */
    .long   DefaultISR                       /* Vector #  21 */
    .long   DefaultISR                       /* Vector #  22 */
    .long   DefaultISR                       /* Vector #  23 */
    .long   DefaultISR                       /* Vector #  24 */
    .long   DefaultISR                       /* Vector #  25 */
    .long   DefaultISR                       /* Vector #  26 */
    .long   DefaultISR                       /* Vector #  27 */
    .long   DefaultISR                       /* Vector #  28 */
    .long   DefaultISR                       /* Vector #  29 */
    .long   DefaultISR                       /* Vector #  30 */
    .long   DefaultISR                       /* Vector #  31 */
    .long   SWT0_IRQHandler                  /* Vector #  32 */
    .long   DefaultISR                       /* Vector #  33 */
    .long   DefaultISR                       /* Vector #  34 */
    .long   DefaultISR                       /* Vector #  35 */
    .long   STM0_Ch0_IRQHandler              /* Vector #  36 On-Platform periodic timer 0_0 (STM) STM_0_CIR0[CIF] */
    .long   STM0_Ch1_IRQHandler              /* Vector #  37 On-Platform periodic timer 0_1 (STM) STM_0_CIR1[CIF] */
    .long   STM0_Ch2_IRQHandler              /* Vector #  38 On-Platform periodic timer 0_2 (STM) STM_0_CIR2[CIF] */
    .long   STM0_Ch3_IRQHandler              /* Vector #  39 On-Platform periodic timer 0_3 (STM) STM_0_CIR3[CIF] */
    .long   DefaultISR                       /* Vector #  40 */
    .long   DefaultISR                       /* Vector #  41 */
    .long   DefaultISR                       /* Vector #  42 */
    .long   DefaultISR                       /* Vector #  43 */
    .long   DefaultISR                       /* Vector #  44 */
    .long   DefaultISR                       /* Vector #  45 */
    .long   DefaultISR                       /* Vector #  46 */
    .long   DefaultISR                       /* Vector #  47 */
    .long   DefaultISR                       /* Vector #  48 */
    .long   DefaultISR                       /* Vector #  49 */
    .long   DefaultISR                       /* Vector #  50 */
    .long   DefaultISR                       /* Vector #  51 */
    .long   DMA0_Ch0_Ch31_Error_IRQHandler   /* Vector #  52 eDMA0 Combined Error eDMA0 Channel Error Flags 0-31 */
    .long   DMA0_Ch0_IRQHandler              /* Vector #  53 eDMA0 Channel 0 DMA_INTL[INT0] */
    .long   DMA0_Ch1_IRQHandler              /* Vector #  54 eDMA0 Channel 1 DMA_INTL[INT1] */
    .long   DMA0_Ch2_IRQHandler              /* Vector #  55 eDMA0 Channel 2 DMA_INTL[INT2] */
    .long   DMA0_Ch3_IRQHandler              /* Vector #  56 eDMA0 Channel 3 DMA_INTL[INT3] */
    .long   DMA0_Ch4_IRQHandler              /* Vector #  57 eDMA0 Channel 4 DMA_INTL[INT4] */
    .long   DMA0_Ch5_IRQHandler              /* Vector #  58 eDMA0 Channel 5 DMA_INTL[INT5] */
    .long   DMA0_Ch6_IRQHandler              /* Vector #  59 eDMA0 Channel 6 DMA_INTL[INT6] */
    .long   DMA0_Ch7_IRQHandler              /* Vector #  60 eDMA0 Channel 7 DMA_INTL[INT7] */
    .long   DMA0_Ch8_IRQHandler              /* Vector #  61 eDMA0 Channel 8 DMA_INTL[INT8] */
    .long   DMA0_Ch9_IRQHandler              /* Vector #  62 eDMA0 Channel 9 DMA_INTL[INT9] */
    .long   DMA0_Ch10_IRQHandler             /* Vector #  63 eDMA0 Channel 10 DMA_INTL[INT10] */
    .long   DMA0_Ch11_IRQHandler             /* Vector #  64 eDMA0 Channel 11 DMA_INTL[INT11] */
    .long   DMA0_Ch12_IRQHandler             /* Vector #  65 eDMA0 Channel 12 DMA_INTL[INT12] */
    .long   DMA0_Ch13_IRQHandler             /* Vector #  66 eDMA0 Channel 13 DMA_INTL[INT13] */
    .long   DMA0_Ch14_IRQHandler             /* Vector #  67 eDMA0 Channel 14 DMA_INTL[INT14] */
    .long   DMA0_Ch15_IRQHandler             /* Vector #  67 eDMA0 Channel 15 DMA_INTL[INT15] */
    .long   DMA0_Ch16_IRQHandler             /* Vector #  69 eDMA0 Channel 16 DMA_INTL[INT16] */
    .long   DMA0_Ch17_IRQHandler             /* Vector #  70 eDMA0 Channel 17 DMA_INTL[INT17] */
    .long   DMA0_Ch18_IRQHandler             /* Vector #  71 eDMA0 Channel 18 DMA_INTL[INT18] */
    .long   DMA0_Ch19_IRQHandler             /* Vector #  72 eDMA0 Channel 19 DMA_INTL[INT19] */
    .long   DMA0_Ch20_IRQHandler             /* Vector #  73 eDMA0 Channel 20 DMA_INTL[INT20] */
    .long   DMA0_Ch21_IRQHandler             /* Vector #  74 eDMA0 Channel 21 DMA_INTL[INT21] */
    .long   DMA0_Ch22_IRQHandler             /* Vector #  75 eDMA0 Channel 22 DMA_INTL[INT22] */
    .long   DMA0_Ch23_IRQHandler             /* Vector #  76 eDMA0 Channel 23 DMA_INTL[INT23] */
    .long   DMA0_Ch24_IRQHandler             /* Vector #  77 eDMA0 Channel 24 DMA_INTL[INT24] */
    .long   DMA0_Ch25_IRQHandler             /* Vector #  78 eDMA0 Channel 25 DMA_INTL[INT25] */
    .long   DMA0_Ch26_IRQHandler             /* Vector #  79 eDMA0 Channel 26 DMA_INTL[INT26] */
    .long   DMA0_Ch27_IRQHandler             /* Vector #  80 eDMA0 Channel 27 DMA_INTL[INT27] */
    .long   DMA0_Ch28_IRQHandler             /* Vector #  81 eDMA0 Channel 28 DMA_INTL[INT28] */
    .long   DMA0_Ch29_IRQHandler             /* Vector #  82 eDMA0 Channel 29 DMA_INTL[INT29] */
    .long   DMA0_Ch30_IRQHandler             /* Vector #  83 eDMA0 Channel 30 DMA_INTL[INT30] */
    .long   DMA0_Ch31_IRQHandler             /* Vector #  84 eDMA0 Channel 31 DMA_INTL[INT31] */
    .long   DefaultISR                       /* Vector #  85 */
    .long   DefaultISR                       /* Vector #  86 */
    .long   DefaultISR                       /* Vector #  87 */
    .long   DefaultISR                       /* Vector #  88 */
    .long   DefaultISR                       /* Vector #  89 */
    .long   DefaultISR                       /* Vector #  90 */
    .long   DefaultISR                       /* Vector #  91 */
    .long   DefaultISR                       /* Vector #  92 */
    .long   DefaultISR                       /* Vector #  93 */
    .long   DefaultISR                       /* Vector #  94 */
    .long   DefaultISR                       /* Vector #  95 */
    .long   DefaultISR                       /* Vector #  96 */
    .long   DefaultISR                       /* Vector #  97 */
    .long   DefaultISR                       /* Vector #  98 */
    .long   DefaultISR                       /* Vector #  99 */
    .long   DefaultISR                       /* Vector # 100 */
    .long   DefaultISR                       /* Vector # 101 */
    .long   DefaultISR                       /* Vector # 102 */
    .long   DefaultISR                       /* Vector # 103 */
    .long   DefaultISR                       /* Vector # 104 */
    .long   DefaultISR                       /* Vector # 105 */
    .long   DefaultISR                       /* Vector # 106 */
    .long   DefaultISR                       /* Vector # 107 */
    .long   DefaultISR                       /* Vector # 108 */
    .long   DefaultISR                       /* Vector # 109 */
    .long   DefaultISR                       /* Vector # 110 */
    .long   DefaultISR                       /* Vector # 111 */
    .long   DefaultISR                       /* Vector # 112 */
    .long   DefaultISR                       /* Vector # 113 */
    .long   DefaultISR                       /* Vector # 114 */
    .long   DefaultISR                       /* Vector # 115 */
    .long   DefaultISR                       /* Vector # 116 */
    .long   DefaultISR                       /* Vector # 117 */
    .long   DefaultISR                       /* Vector # 118 */
    .long   DefaultISR                       /* Vector # 119 */
    .long   DefaultISR                       /* Vector # 120 */
    .long   DefaultISR                       /* Vector # 121 */
    .long   DefaultISR                       /* Vector # 122 */
    .long   DefaultISR                       /* Vector # 123 */
    .long   DefaultISR                       /* Vector # 124 */
    .long   DefaultISR                       /* Vector # 125 */
    .long   DefaultISR                       /* Vector # 126 */
    .long   DefaultISR                       /* Vector # 127 */
    .long   DefaultISR                       /* Vector # 128 */
    .long   DefaultISR                       /* Vector # 129 */
    .long   DefaultISR                       /* Vector # 130 */
    .long   DefaultISR                       /* Vector # 131 */
    .long   DefaultISR                       /* Vector # 132 */
    .long   DefaultISR                       /* Vector # 133 */
    .long   DefaultISR                       /* Vector # 134 */
    .long   DefaultISR                       /* Vector # 135 */
    .long   DefaultISR                       /* Vector # 136 */
    .long   DefaultISR                       /* Vector # 137 */
    .long   DefaultISR                       /* Vector # 138 */
    .long   DefaultISR                       /* Vector # 139 */
    .long   DefaultISR                       /* Vector # 140 */
    .long   DefaultISR                       /* Vector # 141 */
    .long   DefaultISR                       /* Vector # 142 */
    .long   DefaultISR                       /* Vector # 143 */
    .long   DefaultISR                       /* Vector # 144 */
    .long   DefaultISR                       /* Vector # 145 */
    .long   DefaultISR                       /* Vector # 146 */
    .long   DefaultISR                       /* Vector # 147 */
    .long   DefaultISR                       /* Vector # 148 */
    .long   DefaultISR                       /* Vector # 149 */
    .long   DefaultISR                       /* Vector # 150 */
    .long   DefaultISR                       /* Vector # 151 */
    .long   DefaultISR                       /* Vector # 152 */
    .long   DefaultISR                       /* Vector # 153 */
    .long   DefaultISR                       /* Vector # 154 */
    .long   DefaultISR                       /* Vector # 155 */
    .long   DefaultISR                       /* Vector # 156 */
    .long   DefaultISR                       /* Vector # 157 */
    .long   DefaultISR                       /* Vector # 158 */
    .long   DefaultISR                       /* Vector # 159 */
    .long   DefaultISR                       /* Vector # 160 */
    .long   DefaultISR                       /* Vector # 161 */
    .long   DefaultISR                       /* Vector # 162 */
    .long   DefaultISR                       /* Vector # 163 */
    .long   DefaultISR                       /* Vector # 164 */
    .long   DefaultISR                       /* Vector # 165 */
    .long   DefaultISR                       /* Vector # 166 */
    .long   DefaultISR                       /* Vector # 167 */
    .long   DefaultISR                       /* Vector # 168 */
    .long   DefaultISR                       /* Vector # 169 */
    .long   DefaultISR                       /* Vector # 170 */
    .long   DefaultISR                       /* Vector # 171 */
    .long   DefaultISR                       /* Vector # 172 */
    .long   DefaultISR                       /* Vector # 173 */
    .long   DefaultISR                       /* Vector # 174 */
    .long   DefaultISR                       /* Vector # 175 */
    .long   DefaultISR                       /* Vector # 176 */
    .long   DefaultISR                       /* Vector # 177 */
    .long   DefaultISR                       /* Vector # 178 */
    .long   DefaultISR                       /* Vector # 179 */
    .long   DefaultISR                       /* Vector # 180 */
    .long   DefaultISR                       /* Vector # 181 */
    .long   DefaultISR                       /* Vector # 182 */
    .long   DefaultISR                       /* Vector # 183 */
    .long   DefaultISR                       /* Vector # 184 */
    .long   FLASH_Done_IRQHandler            /* Vector # 185 Flash controller Prog/Erase/Suspend IRQ_0 MCR[DONE] */
    .long   DefaultISR                       /* Vector # 186 */
    .long   DefaultISR                       /* Vector # 187 */
    .long   DefaultISR                       /* Vector # 188 */
    .long   DefaultISR                       /* Vector # 189 */
    .long   DefaultISR                       /* Vector # 190 */
    .long   DefaultISR                       /* Vector # 191 */
    .long   DefaultISR                       /* Vector # 192 */
    .long   DefaultISR                       /* Vector # 193 */
    .long   DefaultISR                       /* Vector # 194 */
    .long   DefaultISR                       /* Vector # 195 */
    .long   DefaultISR                       /* Vector # 196 */
    .long   DefaultISR                       /* Vector # 197 */
    .long   DefaultISR                       /* Vector # 198 */
    .long   DefaultISR                       /* Vector # 199 */
    .long   DefaultISR                       /* Vector # 200 */
    .long   DefaultISR                       /* Vector # 201 */
    .long   DefaultISR                       /* Vector # 202 */
    .long   DefaultISR                       /* Vector # 203 */
    .long   DefaultISR                       /* Vector # 204 */
    .long   DefaultISR                       /* Vector # 205 */
    .long   DefaultISR                       /* Vector # 206 */
    .long   DefaultISR                       /* Vector # 207 */
    .long   DefaultISR                       /* Vector # 208 */
    .long   DefaultISR                       /* Vector # 209 */
    .long   DefaultISR                       /* Vector # 210 */
    .long   DefaultISR                       /* Vector # 211 */
    .long   DefaultISR                       /* Vector # 212 */
    .long   DefaultISR                       /* Vector # 213 */
    .long   DefaultISR                       /* Vector # 214 */
    .long   DefaultISR                       /* Vector # 215 */
    .long   ENET0_Timer_IRQHandler           /* Vector # 216 Timer IRQ Ethernet 0 */
    .long   ENET0_Tx_IRQHandler              /* Vector # 217 TX IRQ Ethernet 0 */
    .long   ENET0_Rx_IRQHandler              /* Vector # 218 RX IRQ Ethernet 0 */
    .long   ENET0_Err_IRQHandler             /* Vector # 219 Error/Generic IRQ1 Ethernet 0 */
    .long   DefaultISR                       /* Vector # 220 */
    .long   DefaultISR                       /* Vector # 221 */
    .long   DefaultISR                       /* Vector # 222 */
    .long   DefaultISR                       /* Vector # 223 */
    .long   DefaultISR                       /* Vector # 224 */
    .long   DefaultISR                       /* Vector # 225 */
    .long   PIT_Ch0_IRQHandler               /* Vector # 226 PIT channel 0 overflow interrupt */
    .long   PIT_Ch1_IRQHandler               /* Vector # 227 PIT channel 1 overflow interrupt */
    .long   PIT_Ch2_IRQHandler               /* Vector # 228 PIT channel 2 overflow interrupt */
    .long   PIT_Ch3_IRQHandler               /* Vector # 229 PIT channel 3 overflow interrupt */
    .long   DefaultISR                       /* Vector # 230 */
    .long   DefaultISR                       /* Vector # 231 */
    .long   DefaultISR                       /* Vector # 232 */
    .long   DefaultISR                       /* Vector # 233 */
    .long   DefaultISR                       /* Vector # 234 */
    .long   DefaultISR                       /* Vector # 235 */
    .long   DefaultISR                       /* Vector # 236 */
    .long   DefaultISR                       /* Vector # 237 */
    .long   DefaultISR                       /* Vector # 238 */
    .long   DefaultISR                       /* Vector # 239 */
    .long   DefaultISR                       /* Vector # 240 */
    .long   DefaultISR                       /* Vector # 241 */
    .long   DefaultISR                       /* Vector # 242 */
    .long   SIUL_EIRQ_00_07_IRQHandler       /* Vector # 243 SIUL EIRQ [0-7] - SIUL Combined External Interrupt */
    .long   SIUL_EIRQ_08_15_IRQHandler       /* Vector # 244 SIUL EIRQ [8-15] - SIUL Combined External Interrupt */
    .long   SIUL_EIRQ_16_23_IRQHandler       /* Vector # 245 SIUL EIRQ [16-23] - SIUL Combined External Interrupt */
    .long   SIUL_EIRQ_24_31_IRQHandler       /* Vector # 246 SIUL EIRQ [24-31] - SIUL Combined External Interrupt */
    .long   DefaultISR                       /* Vector # 247 */
    .long   DefaultISR                       /* Vector # 248 */
    .long   DefaultISR                       /* Vector # 249 */
    .long   DefaultISR                       /* Vector # 250 */
    .long   DefaultISR                       /* Vector # 251 */
    .long   DefaultISR                       /* Vector # 252 */
    .long   DefaultISR                       /* Vector # 253 */
    .long   DefaultISR                       /* Vector # 254 */
    .long   DefaultISR                       /* Vector # 255 */
    .long   DefaultISR                       /* Vector # 256 */
    .long   DefaultISR                       /* Vector # 257 */
    .long   DefaultISR                       /* Vector # 258 */
    .long   DSPI0_FIFO_Error_IRQHandler      /* Vector # 259 DSPI0_0 DSPI_0_SR[TFUF] | DSPI_0_SR[RFOF]| DSPI_0_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 260 DSPI0_1 DSPI_0_SR[EOQF]                                     */
    .long   DSPI0_Send_IRQHandler            /* Vector # 261 DSPI0_2 DSPI_0_SR[TFFF]                                     */
    .long   DefaultISR                       /* Vector # 262 DSPI0_3 DSPI_0_SR[TCF]                                      */
    .long   DSPI0_Receive_IRQHandler         /* Vector # 263 DSPI0_4 DSPI_0_SR[RFDF]                                     */
    .long   DefaultISR                       /* Vector # 264 DSPI0_5 DSPI_0_SR[SPITCF] | DSPI_0_SR[CMD_TCF]              */
    .long   DefaultISR                       /* Vector # 265 DSPI0_6 DSPI_0_SR[DSITCF] | DSPI_0_SR[CMDFFF]               */
    .long   DefaultISR                       /* Vector # 266 DSPI0_7 DSPI_0_SR[SPEF] | DSPI_0_SR[DPEF]                   */
    .long   DefaultISR                       /* Vector # 267 DSPI0_8 DSPI_0_SR[DDIF]                                     */
