naughtyMin/MPC5744UnifiedBootloader/LedApp/Project_Settings/Startup_Code/startup_MPC5744P.S
    .long   DefaultISR                       /* Vector # 600 */
    .long   DefaultISR                       /* Vector # 601 */
    .long   DefaultISR                       /* Vector # 602 */
    .long   DefaultISR                       /* Vector # 603 */
    .long   DefaultISR                       /* Vector # 604 */
    .long   DefaultISR                       /* Vector # 605 */
    .long   DefaultISR                       /* Vector # 606 */
    .long   DefaultISR                       /* Vector # 607 */
    .long   DefaultISR                       /* Vector # 608 */
    .long   DefaultISR                       /* Vector # 609 */
    .long   DefaultISR                       /* Vector # 610 */
    .long   ETIMER0_TC0IR_IRQHandler         /* Vector # 611 ETIMER0_TC0IR */
    .long   ETIMER0_TC1IR_IRQHandler         /* Vector # 612 ETIMER0_TC1IR */
    .long   ETIMER0_TC2IR_IRQHandler         /* Vector # 613 ETIMER0_TC2IR */
    .long   ETIMER0_TC3IR_IRQHandler         /* Vector # 614 ETIMER0_TC3IR */
    .long   ETIMER0_TC4IR_IRQHandler         /* Vector # 615 ETIMER0_TC4IR */
    .long   ETIMER0_TC5IR_IRQHandler         /* Vector # 616 ETIMER0_TC5IR */
    .long   DefaultISR                       /* Vector # 617 */
    .long   DefaultISR                       /* Vector # 618 */
    .long   ETIMER0_WTIF_IRQHandler          /* Vector # 619 ETIMER0_WTIF */
    .long   DefaultISR                       /* Vector # 620 */
    .long   ETIMER0_RCF_IRQHandler           /* Vector # 621 ETIMER0_RCF */
    .long   ETIMER1_TC0IR_IRQHandler         /* Vector # 622 ETIMER1_TC0IR */
    .long   ETIMER1_TC1IR_IRQHandler         /* Vector # 623 ETIMER1_TC1IR */
    .long   ETIMER1_TC2IR_IRQHandler         /* Vector # 624 ETIMER1_TC2IR */
    .long   ETIMER1_TC3IR_IRQHandler         /* Vector # 625 ETIMER1_TC3IR */
    .long   ETIMER1_TC4IR_IRQHandler         /* Vector # 626 ETIMER1_TC4IR */
    .long   ETIMER1_TC5IR_IRQHandler         /* Vector # 627 ETIMER1_TC5IR */
    .long   DefaultISR                       /* Vector # 628 */
    .long   DefaultISR                       /* Vector # 629 */
    .long   DefaultISR                       /* Vector # 630 */
    .long   DefaultISR                       /* Vector # 631 */
    .long   ETIMER1_RCF_IRQHandler           /* Vector # 632 ETIMER1_RCF */
    .long   ETIMER2_TC0IR_IRQHandler         /* Vector # 633 ETIMER2_TC0IR */
    .long   ETIMER2_TC1IR_IRQHandler         /* Vector # 634 ETIMER2_TC1IR */
    .long   ETIMER2_TC2IR_IRQHandler         /* Vector # 635 ETIMER2_TC2IR */
    .long   ETIMER2_TC3IR_IRQHandler         /* Vector # 636 ETIMER2_TC3IR */
    .long   ETIMER2_TC4IR_IRQHandler         /* Vector # 637 ETIMER2_TC4IR */
    .long   ETIMER2_TC5IR_IRQHandler         /* Vector # 638 ETIMER2_TC5IR */
    .long   DefaultISR                       /* Vector # 639 */
    .long   DefaultISR                       /* Vector # 640 */
    .long   DefaultISR                       /* Vector # 641 */
    .long   DefaultISR                       /* Vector # 642 */
    .long   ETIMER2_RCF_IRQHandler           /* Vector # 643 ETIMER2_RCF */
    .long   DefaultISR                       /* Vector # 644 */
    .long   DefaultISR                       /* Vector # 645 */
    .long   DefaultISR                       /* Vector # 646 */
    .long   DefaultISR                       /* Vector # 647 */
    .long   DefaultISR                       /* Vector # 648 */
    .long   DefaultISR                       /* Vector # 649 */
    .long   DefaultISR                       /* Vector # 650 */
    .long   DefaultISR                       /* Vector # 651 */
    .long   DefaultISR                       /* Vector # 652 */
    .long   DefaultISR                       /* Vector # 653 */
    .long   DefaultISR                       /* Vector # 654 */
    .long   FlexPWM_0_RF0_IRQHandler         /* Vector # 655 FlexPWM_0_RF0      */
    .long   FlexPWM_0_COF0_IRQHandler        /* Vector # 656 FlexPWM_0_COF0     */
    .long   FlexPWM_0_CAF0_IRQHandler        /* Vector # 657 FlexPWM_0_CAF0     */
    .long   FlexPWM_0_RF1_IRQHandler         /* Vector # 658 FlexPWM_0_RF1      */
    .long   FlexPWM_0_COF1_IRQHandler        /* Vector # 659 FlexPWM_0_COF1     */
    .long   FlexPWM_0_CAF1_IRQHandler        /* Vector # 660 FlexPWM_0_CAF1     */
    .long   FlexPWM_0_RF2_IRQHandler         /* Vector # 661 FlexPWM_0_RF2      */
    .long   FlexPWM_0_COF2_IRQHandler        /* Vector # 662 FlexPWM_0_COF2     */
    .long   FlexPWM_0_CAF2_IRQHandler        /* Vector # 663 FlexPWM_0_CAF2     */
    .long   FlexPWM_0_RF3_IRQHandler         /* Vector # 664 FlexPWM_0_RF3      */
    .long   FlexPWM_0_COF3_IRQHandler        /* Vector # 665 FlexPWM_0_COF3     */
    .long   FlexPWM_0_CAF3_IRQHandler        /* Vector # 666 FlexPWM_0_CAF3     */
    .long   FlexPWM_0_FFLAG_IRQHandler       /* Vector # 667 FlexPWM_0_FFLAG    */
    .long   FlexPWM_0_REF_IRQHandler         /* Vector # 668 FlexPWM_0_REF      */
    .long   DefaultISR                       /* Vector # 669 */
    .long   FlexPWM_1_RF0_IRQHandler         /* Vector # 670 FlexPWM_1_RF0      */
    .long   FlexPWM_1_COF0_IRQHandler        /* Vector # 671 FlexPWM_1_COF0     */
    .long   FlexPWM_1_CAF0_IRQHandler        /* Vector # 672 FlexPWM_1_CAF0     */
    .long   FlexPWM_1_RF1_IRQHandler         /* Vector # 673 FlexPWM_1_RF1      */
    .long   FlexPWM_1_COF1_IRQHandler        /* Vector # 674 FlexPWM_1_COF1     */
    .long   FlexPWM_1_CAF1_IRQHandler        /* Vector # 675 FlexPWM_1_CAF1     */
    .long   FlexPWM_1_RF2_IRQHandler         /* Vector # 676 FlexPWM_1_RF2      */
    .long   FlexPWM_1_COF2_IRQHandler        /* Vector # 677 FlexPWM_1_COF2     */
    .long   FlexPWM_1_CAF2_IRQHandler        /* Vector # 678 FlexPWM_1_CAF2     */
    .long   FlexPWM_1_RF3_IRQHandler         /* Vector # 679 FlexPWM_1_RF3      */
    .long   FlexPWM_1_COF3_IRQHandler        /* Vector # 680 FlexPWM_1_COF3     */
    .long   FlexPWM_1_CAF3_IRQHandler        /* Vector # 681 FlexPWM_1_CAF3     */
    .long   FlexPWM_1_FFLAG_IRQHandler       /* Vector # 682 FlexPWM_1_FFLAG    */
    .long   FlexPWM_1_REF_IRQHandler         /* Vector # 683 FlexPWM_1_REF      */
    .long   DefaultISR                       /* Vector # 684 */
    .long   DefaultISR                       /* Vector # 685 */
    .long   DefaultISR                       /* Vector # 686 */
    .long   DefaultISR                       /* Vector # 687 */
    .long   DefaultISR                       /* Vector # 688 */
    .long   DefaultISR                       /* Vector # 689 */
    .long   DefaultISR                       /* Vector # 690 */
    .long   DefaultISR                       /* Vector # 691 */
    .long   DefaultISR                       /* Vector # 692 */
    .long   DefaultISR                       /* Vector # 693 */
    .long   DefaultISR                       /* Vector # 694 */
    .long   DefaultISR                       /* Vector # 695 */
    .long   DefaultISR                       /* Vector # 696 */
    .long   DefaultISR                       /* Vector # 697 */
    .long   DefaultISR                       /* Vector # 698 */
    .long   DefaultISR                       /* Vector # 699 */
    .long   CTU0_MRS_IRQHandler              /* Vector # 700 CTU 0 Master Reload Signal interrupt */
    .long   CTU0_T0_IRQHandler               /* Vector # 701 CTU 0 Trigger 0 interrupt */
    .long   CTU0_T1_IRQHandler               /* Vector # 702 CTU 0 Trigger 1 interrupt */
    .long   CTU0_T2_IRQHandler               /* Vector # 703 CTU 0 Trigger 2 interrupt */
    .long   CTU0_T3_IRQHandler               /* Vector # 704 CTU 0 Trigger 3 interrupt */
    .long   CTU0_T4_IRQHandler               /* Vector # 705 CTU 0 Trigger 4 interrupt */
    .long   CTU0_T5_IRQHandler               /* Vector # 706 CTU 0 Trigger 5 interrupt */
    .long   CTU0_T6_IRQHandler               /* Vector # 707 CTU 0 Trigger 6 interrupt */
    .long   CTU0_T7_IRQHandler               /* Vector # 708 CTU 0 Trigger 7 interrupt */
    .long   CTU0_FIFO0_IRQHandler            /* Vector # 709 CTU 0 FIFO 0 interrupt */
    .long   CTU0_FIFO1_IRQHandler            /* Vector # 710 CTU 0 FIFO 1 interrupt */
    .long   CTU0_FIFO2_IRQHandler            /* Vector # 711 CTU 0 FIFO 2 interrupt */
    .long   CTU0_FIFO3_IRQHandler            /* Vector # 712 CTU 0 FIFO 3 interrupt */
    .long   CTU0_ADC_IRQHandler              /* Vector # 713 CTU 0 ADC interrupt */
    .long   CTU0_ERR_IRQHandler              /* Vector # 714 CTU 0 Error interrupt */
    .long   DefaultISR                       /* Vector # 715 */
    .long   CTU1_MRS_IRQHandler              /* Vector # 716 CTU 1 Master Reload Signal interrupt */
    .long   CTU1_T0_IRQHandler               /* Vector # 717 CTU 1 Trigger 0 interrupt */
    .long   CTU1_T1_IRQHandler               /* Vector # 718 CTU 1 Trigger 1 interrupt */
    .long   CTU1_T2_IRQHandler               /* Vector # 719 CTU 1 Trigger 2 interrupt */
    .long   CTU1_T3_IRQHandler               /* Vector # 720 CTU 1 Trigger 3 interrupt */
    .long   CTU1_T4_IRQHandler               /* Vector # 721 CTU 1 Trigger 4 interrupt */
    .long   CTU1_T5_IRQHandler               /* Vector # 722 CTU 1 Trigger 5 interrupt */
    .long   CTU1_T6_IRQHandler               /* Vector # 723 CTU 1 Trigger 6 interrupt */
    .long   CTU1_T7_IRQHandler               /* Vector # 724 CTU 1 Trigger 7 interrupt */
    .long   CTU1_FIFO0_IRQHandler            /* Vector # 725 CTU 1 FIFO 0 interrupt */
    .long   CTU1_FIFO1_IRQHandler            /* Vector # 726 CTU 1 FIFO 1 interrupt */
    .long   CTU1_FIFO2_IRQHandler            /* Vector # 727 CTU 1 FIFO 2 interrupt */
    .long   CTU1_FIFO3_IRQHandler            /* Vector # 728 CTU 1 FIFO 3 interrupt */
    .long   CTU1_ADC_IRQHandler              /* Vector # 729 CTU 1 ADC interrupt */
    .long   CTU1_ERR_IRQHandler              /* Vector # 730 CTU 1 Error interrupt */
    .long   DefaultISR                       /* Vector # 731 */
    .long   DefaultISR                       /* Vector # 732 */
    .long   DefaultISR                       /* Vector # 733 */
    .long   DefaultISR                       /* Vector # 734 */
    .long   DefaultISR                       /* Vector # 735 */
    .long   DefaultISR                       /* Vector # 736 */
    .long   DefaultISR                       /* Vector # 737 */
    .long   DefaultISR                       /* Vector # 738 */
    .long   DefaultISR                       /* Vector # 739 */
    .long   DefaultISR                       /* Vector # 740 */
    .long   DefaultISR                       /* Vector # 741 */
    .long   DefaultISR                       /* Vector # 742 */
    .long   DefaultISR                       /* Vector # 743 */
    .long   DefaultISR                       /* Vector # 744 */
    .long   DefaultISR                       /* Vector # 745 */
    .long   DefaultISR                       /* Vector # 746 */
    .long   DefaultISR                       /* Vector # 747 */
    .long   DefaultISR                       /* Vector # 748 */
    .long   DefaultISR                       /* Vector # 749 */
    .long   DefaultISR                       /* Vector # 750 */
    .long   DefaultISR                       /* Vector # 751 */
    .long   DefaultISR                       /* Vector # 752 */
    .long   DefaultISR                       /* Vector # 753 */

    .align  2
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    e_b       DefaultISR
    .size DefaultISR, . - DefaultISR

