naughtyMin/MPC5744UnifiedBootloader/LedApp/Project_Settings/Startup_Code/startup_MPC5744P.S
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm

/* Exception Handlers */
    def_irq_handler    IVOR0_Handler
    def_irq_handler    IVOR1_Handler
    def_irq_handler    IVOR2_Handler
    def_irq_handler    IVOR3_Handler
    def_irq_handler    IVOR4_Handler
    def_irq_handler    IVOR5_Handler
    def_irq_handler    IVOR6_Handler
    def_irq_handler    IVOR8_Handler
    def_irq_handler    IVOR15_Handler
    def_irq_handler    IVOR33_Handler
    def_irq_handler    IVOR34_Handler
    def_irq_handler    IVOR35_Handler
    def_irq_handler    IVOR0_Exception_Handler
    def_irq_handler    IVOR1_Exception_Handler
    def_irq_handler    IVOR2_Exception_Handler
    def_irq_handler    IVOR3_Exception_Handler
    def_irq_handler    IVOR5_Exception_Handler
    def_irq_handler    IVOR6_Exception_Handler
    def_irq_handler    IVOR8_Exception_Handler
    def_irq_handler    IVOR15_Exception_Handler
    def_irq_handler    IVOR33_Exception_Handler
    def_irq_handler    IVOR34_Exception_Handler
    def_irq_handler    IVOR35_Exception_Handler
    def_irq_handler    DMA0_Ch0_Ch31_Error_IRQHandler
    def_irq_handler    DMA0_Ch0_IRQHandler
    def_irq_handler    DMA0_Ch1_IRQHandler
    def_irq_handler    DMA0_Ch2_IRQHandler
    def_irq_handler    DMA0_Ch3_IRQHandler
    def_irq_handler    DMA0_Ch4_IRQHandler
    def_irq_handler    DMA0_Ch5_IRQHandler
    def_irq_handler    DMA0_Ch6_IRQHandler
    def_irq_handler    DMA0_Ch7_IRQHandler
    def_irq_handler    DMA0_Ch8_IRQHandler
    def_irq_handler    DMA0_Ch9_IRQHandler
    def_irq_handler    DMA0_Ch10_IRQHandler
    def_irq_handler    DMA0_Ch11_IRQHandler
    def_irq_handler    DMA0_Ch12_IRQHandler
    def_irq_handler    DMA0_Ch13_IRQHandler
    def_irq_handler    DMA0_Ch14_IRQHandler
    def_irq_handler    DMA0_Ch15_IRQHandler
    def_irq_handler    DMA0_Ch16_IRQHandler
    def_irq_handler    DMA0_Ch17_IRQHandler
    def_irq_handler    DMA0_Ch18_IRQHandler
    def_irq_handler    DMA0_Ch19_IRQHandler
    def_irq_handler    DMA0_Ch20_IRQHandler
    def_irq_handler    DMA0_Ch21_IRQHandler
    def_irq_handler    DMA0_Ch22_IRQHandler
    def_irq_handler    DMA0_Ch23_IRQHandler
    def_irq_handler    DMA0_Ch24_IRQHandler
    def_irq_handler    DMA0_Ch25_IRQHandler
    def_irq_handler    DMA0_Ch26_IRQHandler
    def_irq_handler    DMA0_Ch27_IRQHandler
    def_irq_handler    DMA0_Ch28_IRQHandler
    def_irq_handler    DMA0_Ch29_IRQHandler
    def_irq_handler    DMA0_Ch30_IRQHandler
    def_irq_handler    DMA0_Ch31_IRQHandler
    def_irq_handler    SWT0_IRQHandler
    def_irq_handler    STM0_Ch0_IRQHandler
    def_irq_handler    STM0_Ch1_IRQHandler
    def_irq_handler    STM0_Ch2_IRQHandler
    def_irq_handler    STM0_Ch3_IRQHandler
    def_irq_handler    ENET0_Timer_IRQHandler
    def_irq_handler    ENET0_Tx_IRQHandler
    def_irq_handler    ENET0_Rx_IRQHandler
    def_irq_handler    ENET0_Err_IRQHandler
    def_irq_handler    PIT_Ch0_IRQHandler
    def_irq_handler    PIT_Ch1_IRQHandler
    def_irq_handler    PIT_Ch2_IRQHandler
    def_irq_handler    PIT_Ch3_IRQHandler
    def_irq_handler    LINFLEXD0_UART_RxIRQHandler
    def_irq_handler    LINFLEXD0_UART_TxIRQHandler
    def_irq_handler    LINFLEXD0_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD1_UART_RxIRQHandler
    def_irq_handler    LINFLEXD1_UART_TxIRQHandler
    def_irq_handler    LINFLEXD1_UART_ErrIRQHandler
    def_irq_handler    FCCU0_IRQ_Handler
    def_irq_handler    CAN0_Error_IRQHandler
    def_irq_handler    CAN0_ORed_IRQHandler
    def_irq_handler    CAN0_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN0_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN0_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN0_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN0_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN0_ORed_32_39_MB_IRQHandler
    def_irq_handler    CAN0_ORed_40_47_MB_IRQHandler
    def_irq_handler    CAN0_ORed_48_55_MB_IRQHandler
    def_irq_handler    CAN0_ORed_56_63_MB_IRQHandler
    def_irq_handler    CAN1_Error_IRQHandler
    def_irq_handler    CAN1_ORed_IRQHandler
    def_irq_handler    CAN1_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN1_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN1_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN1_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN1_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN1_ORed_32_39_MB_IRQHandler
    def_irq_handler    CAN1_ORed_40_47_MB_IRQHandler
    def_irq_handler    CAN1_ORed_48_55_MB_IRQHandler
    def_irq_handler    CAN1_ORed_56_63_MB_IRQHandler
    def_irq_handler    CAN2_Error_IRQHandler
    def_irq_handler    CAN2_ORed_IRQHandler
    def_irq_handler    CAN2_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN2_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN2_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN2_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN2_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN2_ORed_32_39_MB_IRQHandler
    def_irq_handler    CAN2_ORed_40_47_MB_IRQHandler
    def_irq_handler    CAN2_ORed_48_55_MB_IRQHandler
    def_irq_handler    CAN2_ORed_56_63_MB_IRQHandler
    def_irq_handler    FLASH_Done_IRQHandler
    def_irq_handler    ETIMER0_TC0IR_IRQHandler
    def_irq_handler    ETIMER0_TC1IR_IRQHandler
    def_irq_handler    ETIMER0_TC2IR_IRQHandler
    def_irq_handler    ETIMER0_TC3IR_IRQHandler
    def_irq_handler    ETIMER0_TC4IR_IRQHandler
    def_irq_handler    ETIMER0_TC5IR_IRQHandler
    def_irq_handler    ETIMER0_WTIF_IRQHandler
    def_irq_handler    ETIMER0_RCF_IRQHandler
    def_irq_handler    ETIMER1_TC0IR_IRQHandler
    def_irq_handler    ETIMER1_TC1IR_IRQHandler
    def_irq_handler    ETIMER1_TC2IR_IRQHandler
    def_irq_handler    ETIMER1_TC3IR_IRQHandler
    def_irq_handler    ETIMER1_TC4IR_IRQHandler
    def_irq_handler    ETIMER1_TC5IR_IRQHandler
    def_irq_handler    ETIMER1_RCF_IRQHandler
    def_irq_handler    ETIMER2_TC0IR_IRQHandler
    def_irq_handler    ETIMER2_TC1IR_IRQHandler
    def_irq_handler    ETIMER2_TC2IR_IRQHandler
    def_irq_handler    ETIMER2_TC3IR_IRQHandler
    def_irq_handler    ETIMER2_TC4IR_IRQHandler
    def_irq_handler    ETIMER2_TC5IR_IRQHandler
    def_irq_handler    ETIMER2_RCF_IRQHandler
    def_irq_handler    CTU0_MRS_IRQHandler
    def_irq_handler    CTU0_T0_IRQHandler
    def_irq_handler    CTU0_T1_IRQHandler
    def_irq_handler    CTU0_T2_IRQHandler
    def_irq_handler    CTU0_T3_IRQHandler
    def_irq_handler    CTU0_T4_IRQHandler
    def_irq_handler    CTU0_T5_IRQHandler
    def_irq_handler    CTU0_T6_IRQHandler
    def_irq_handler    CTU0_T7_IRQHandler
    def_irq_handler    CTU0_FIFO0_IRQHandler
    def_irq_handler    CTU0_FIFO1_IRQHandler
    def_irq_handler    CTU0_FIFO2_IRQHandler
    def_irq_handler    CTU0_FIFO3_IRQHandler
    def_irq_handler    CTU0_ADC_IRQHandler
    def_irq_handler    CTU0_ERR_IRQHandler
    def_irq_handler    CTU1_MRS_IRQHandler
    def_irq_handler    CTU1_T0_IRQHandler
    def_irq_handler    CTU1_T1_IRQHandler
    def_irq_handler    CTU1_T2_IRQHandler
    def_irq_handler    CTU1_T3_IRQHandler
    def_irq_handler    CTU1_T4_IRQHandler
    def_irq_handler    CTU1_T5_IRQHandler
    def_irq_handler    CTU1_T6_IRQHandler
    def_irq_handler    CTU1_T7_IRQHandler
    def_irq_handler    CTU1_FIFO0_IRQHandler
    def_irq_handler    CTU1_FIFO1_IRQHandler
    def_irq_handler    CTU1_FIFO2_IRQHandler
    def_irq_handler    CTU1_FIFO3_IRQHandler
    def_irq_handler    CTU1_ADC_IRQHandler
    def_irq_handler    CTU1_ERR_IRQHandler
    def_irq_handler    DSPI0_FIFO_Error_IRQHandler
    def_irq_handler    DSPI0_Send_IRQHandler
    def_irq_handler    DSPI0_Receive_IRQHandler
    def_irq_handler    DSPI1_FIFO_Error_IRQHandler
    def_irq_handler    DSPI1_Send_IRQHandler
    def_irq_handler    DSPI1_Receive_IRQHandler
    def_irq_handler    DSPI2_FIFO_Error_IRQHandler
    def_irq_handler    DSPI2_Send_IRQHandler
    def_irq_handler    DSPI2_Receive_IRQHandler
    def_irq_handler    DSPI3_FIFO_Error_IRQHandler
    def_irq_handler    DSPI3_Send_IRQHandler
    def_irq_handler    DSPI3_Receive_IRQHandler
    def_irq_handler    SIUL_EIRQ_00_07_IRQHandler
    def_irq_handler    SIUL_EIRQ_08_15_IRQHandler
    def_irq_handler    SIUL_EIRQ_16_23_IRQHandler
    def_irq_handler    SIUL_EIRQ_24_31_IRQHandler
    def_irq_handler    ADC0_EOC_IRQHandler
    def_irq_handler    ADC0_ER_IRQHandler
    def_irq_handler    ADC0_WD_IRQHandler
    def_irq_handler    ADC1_EOC_IRQHandler
    def_irq_handler    ADC1_ER_IRQHandler
    def_irq_handler    ADC1_WD_IRQHandler
    def_irq_handler    ADC2_EOC_IRQHandler
    def_irq_handler    ADC2_ER_IRQHandler
    def_irq_handler    ADC2_WD_IRQHandler
    def_irq_handler    ADC3_EOC_IRQHandler
    def_irq_handler    ADC3_ER_IRQHandler
    def_irq_handler    ADC3_WD_IRQHandler
    def_irq_handler    SENT0_Fast_0_IRQHandler
    def_irq_handler    SENT0_Slow_0_IRQHandler
    def_irq_handler    SENT0_RxErr_0_IRQHandler
    def_irq_handler    SENT0_Fast_1_IRQHandler
    def_irq_handler    SENT0_Slow_1_IRQHandler
    def_irq_handler    SENT0_RxErr_1_IRQHandler
    def_irq_handler    SENT1_Fast_0_IRQHandler
    def_irq_handler    SENT1_Slow_0_IRQHandler
    def_irq_handler    SENT1_RxErr_0_IRQHandler
    def_irq_handler    SENT1_Fast_1_IRQHandler
    def_irq_handler    SENT1_Slow_1_IRQHandler
    def_irq_handler    SENT1_RxErr_1_IRQHandler
    def_irq_handler    FlexPWM_0_RF0_IRQHandler
    def_irq_handler    FlexPWM_0_COF0_IRQHandler
    def_irq_handler    FlexPWM_0_CAF0_IRQHandler
    def_irq_handler    FlexPWM_0_RF1_IRQHandler
    def_irq_handler    FlexPWM_0_COF1_IRQHandler
    def_irq_handler    FlexPWM_0_CAF1_IRQHandler
    def_irq_handler    FlexPWM_0_RF2_IRQHandler
    def_irq_handler    FlexPWM_0_COF2_IRQHandler
    def_irq_handler    FlexPWM_0_CAF2_IRQHandler
    def_irq_handler    FlexPWM_0_RF3_IRQHandler
    def_irq_handler    FlexPWM_0_COF3_IRQHandler
    def_irq_handler    FlexPWM_0_CAF3_IRQHandler
    def_irq_handler    FlexPWM_0_FFLAG_IRQHandler
    def_irq_handler    FlexPWM_0_REF_IRQHandler
    def_irq_handler    FlexPWM_1_RF0_IRQHandler
    def_irq_handler    FlexPWM_1_COF0_IRQHandler
    def_irq_handler    FlexPWM_1_CAF0_IRQHandler
    def_irq_handler    FlexPWM_1_RF1_IRQHandler
    def_irq_handler    FlexPWM_1_COF1_IRQHandler
    def_irq_handler    FlexPWM_1_CAF1_IRQHandler
    def_irq_handler    FlexPWM_1_RF2_IRQHandler
    def_irq_handler    FlexPWM_1_COF2_IRQHandler
    def_irq_handler    FlexPWM_1_CAF2_IRQHandler
    def_irq_handler    FlexPWM_1_RF3_IRQHandler
    def_irq_handler    FlexPWM_1_COF3_IRQHandler
    def_irq_handler    FlexPWM_1_CAF3_IRQHandler
    def_irq_handler    FlexPWM_1_FFLAG_IRQHandler
    def_irq_handler    FlexPWM_1_REF_IRQHandler
